6+10
x <- 1:9  # x값을 1에서부터 9까지 값으로 줌.
y <- 99
1:9 ->y
print(y)


x
#x값 도출



#2

install.packages('lattice',depend =TRUE)
# 패키지 설치 과정(하드디스크설치) 
# , depend = 트루 는 다운로드 에러가 날때.
library(lattice)

pacman::p_load(lattice)
# 직접찾아서 깔기 힘들때 쓰는 플러스 코드

install.packages()
# 패키지 설치 "정석"

2+3
(3+6) *8
2^3        # 2의 3제곱 ^ = 제곱
            # 주석처리는 모두가 프로그램을 같이 짜기 때문에 필수.
            # + - * / %%(나눗셈의 나머지) ^(제곱)

8/3
8 %% 3 # 정석!!!!!
8%%3

for()
  
  # 산술연산과 주석
  #- 11~12시 과정!!
  # 함수형 언어, 객체지향 !
  
log(10)+5 #lgg
sqrt(25)  #루트
max(5, 4, 2) #최대값

?log(2)
?log(2, base = 10)
        # 모르는 코드 앞에는 ? , ?? 을 통하여 다시 알아보기)
#12시까지의 수업내용.
